export const exersises = new Map([
	[ `legs`, [
		[
			[`Приседания с гантелями`, [10, 15]],
			[`Приседания на тренажере НАСК SQUAT`, [6, 15]],
			[`Наклонный жим ногами`, [6, 15]],
			[`Горизонтальный жим ногами`, [6, 15]]
		],
		[
			[[`Разгибание ног в тренажере сидя`, [8, 15]], [`Сгибание ног в тренажере лежа`, [8, 15]]],
			[[`Разгибание ног в тренажере сидя`, [8, 15]], [`Сгибание одной ноги стоя`, [10, 20]]],
			[[`Сведение ног сидя`, [15, 25]], [`Разведение ног сидя`, [15, 25]]],
			[`Выпады на месте`, [15, 25]]
		],
		[
			[`Подъемы на носки стоя`, [10, 25]],
			[`Подъем на носок одной ноги стоя`, [12, 24]],
			[`Жим ногами в тренажере на икры`, [15, 25]],
			[`Разгибание голени сидя`, [15, 30]]
		]
	]],

	[ `shoulders`, [
		[
			[`Жим гантелей сидя`, [8, 12]],
			[`Жим Арнольда`, [8, 12]]
		],
		[
			[`Подъемы гантелей вперед попеременно`, [8, 12]],
			[`Подъемы штанги вперед`, [8, 12]],
			[`Подъемы гантелей в стороны`, [8, 12]],
			[`Подъемы гантелей в стороны сидя`, [8, 12]],
			[`Подъем гантели в сторону одной рукой лежа на боку`, [8, 12]],
			[`Подъемы рук в стороны на тренажере`, [8, 12]]
		],
		[
			[`Подъемы гантелей в стороны в наклоне вперед`, [8, 12]],
			[`Махи руками назад с рукоятками тренажера`, [8, 12]],
			[`Перекрестные махи руками назад с верхних блоков`, [8, 12]],
			[`Перекрестные махи руками назад с нижних блоков в наклоне`, [8, 12]],
			[`Подъем одной руки в сторону с нижнего блока`, [8, 12]],
			[`Плечевая передняя протяжка`, [8, 12]]
		]
	]],

	[ `back`, [
		[
			[`Подтягивания на перекладине хватом снизу`, [8, 12]],
			[`Подтягивания на перекладине хватом сверху`, [8, 12]]
		],
		[
			[`Тяга верхнего блока перед собой`, [8, 12]],
			[`Тяга верхнего блока за шею`, [8, 12]],
			[`Тяга верхнего блока узким хватом`, [8, 12]],
			[`Тяга верхнего блока прямыми руками`, [8, 12]]
		],
		[
			[`Тяга нижнего блока (гребля)`, [8, 12]],
			[`Тяга гантели одной рукой`, [8, 12]],
			[`Тяга в тренажере`, [8, 12]]
		],
		[
			[`Шраги с гантелями`, [8, 12]],
			[`Гиперэкстензия (поясничные прогибания)`, [8, 12]]
		]
	]],

	[ `triceps`, [
		[
			[`Разгибание рук со штангой лежа (французский жим)`, [8, 12]],
			[`Разгибание рук с гантелями лежа`, [8, 12]],
			[`Разгибание рук с изогнутым грифом штанги из-за головы`, [8, 12]]
		],
		[
			[`Разгибание одной руки с гантелью из-за головы`, [8, 12]],
			[`Разгибание рук с рукояткой верхнего блока хватом сверху`, [8, 12]],
			[`Разгибание рук с рукояткой верхнего блока хватом снизу`, [8, 12]],
			[`Разгибание одной руки с гантелью из-за головы`, [8, 12]],
			[`Разгибание одной руки назад с гантелью в наклоне`, [8, 12]],
			[`Отжимание трицепсами спиной к скамье`, [8, 12]]
		]
	]],

	[ `chest`, [
		[
			[`Жим штанги на горизонтальной скамье`, [8, 12]],
			[`Жим штанги на горизонтальной скамье`, [8, 12]],
			[`Жим штанги на горизонтальной скамье`, [8, 12]],
			[`Жим гантелей лежа`, [8, 12]]
		],
		[
			[`Жим штанги лёжа на наклонной скамье`, [8, 12]],
			[`Жим гантелей лёжа на наклонной скамье`, [8, 12]]
		],
		[
			[`Разведение гантелей на наклонной скамье`, [8, 12]],
			[`Разведение гантелей лежа`, [8, 12]],
			[`Сведение рук на тренажере`, [8, 12]],
			[`Сведение верхних блоков CROSS-OVER`, [8, 12]]
		]
	]],

	[ `biceps`, [
		[
			[`Попеременные сгибания рук с гантелями`, [8, 12]],
			[`Концентрированное сгибание одной руки с гантелью`, [8, 12]],
			[`Сгибание рук со штангой стоя`, [8, 12]]
		],
		[
			[`Сгибание рук с гантелями хватом молоток`, [8, 12]],
			[`Сгибание одной руки с рукояткой нижнего блока`, [8, 12]],
			[`Сгибание рук со штангой хватом сверху`, [8, 12]]
		]
	]]
]);
